iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Timer 0 Capture Register 0
**---------------------------------------------------------------------------
*/

#define T0CR0_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Capture Register 1
**---------------------------------------------------------------------------
*/

#define T0CR1_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Capture Register 2
**---------------------------------------------------------------------------
*/

#define T0CR2_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Capture Register 3
**---------------------------------------------------------------------------
*/

#define T0CR3_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 External Match Register
**---------------------------------------------------------------------------
*/

#define T0EMR_EMC2                 0x300  /* Bit 9-8: EMC2 (External match control 2) */
#define T0EMR_EMC2_NOTHING         0x00   /* Do nothing */
#define T0EMR_EMC2_CLEAR           0x01   /* Clear output to 0 */
#define T0EMR_EMC2_SET             0x02   /* Set output to 1 */
#define T0EMR_EMC2_TOGGLE          0x03   /* Toggle output */

#define T0EMR_EMC1                 0xc0   /* Bit 7-6: EMC1 (External match control 1) */
#define T0EMR_EMC1_NOTHING         0x00   /* Do nothing */
#define T0EMR_EMC1_CLEAR           0x01   /* Clear output to 0 */
#define T0EMR_EMC1_SET             0x02   /* Set output to 1 */
#define T0EMR_EMC1_TOGGLE          0x03   /* Toggle output */

#define T0EMR_EMC0                 0x30   /* Bit 5-4: EMC0 (External match control 0) */
#define T0EMR_EMC0_NOTHING         0x00   /* Do nothing */
#define T0EMR_EMC0_CLEAR           0x01   /* Clear output to 0 */
#define T0EMR_EMC0_SET             0x02   /* Set output to 1 */
#define T0EMR_EMC0_TOGGLE          0x03   /* Toggle output */

#define T0EMR_EM2                  0x04   /* Bit 2: EM2 (External match 2) */
#define T0EMR_EM2_LOW              0x00   /* Low */
#define T0EMR_EM2_HIGH             0x01   /* High */

#define T0EMR_EM1                  0x02   /* Bit 1: EM1 (External match 1) */
#define T0EMR_EM1_LOW              0x00   /* Low */
#define T0EMR_EM1_HIGH             0x01   /* High */

#define T0EMR_EM0                  0x01   /* Bit 0: EM0 (External match 0) */
#define T0EMR_EM0_LOW              0x00   /* Low */
#define T0EMR_EM0_HIGH             0x01   /* High */


/*
**---------------------------------------------------------------------------
**  Timer 1 Interrupt Register
**---------------------------------------------------------------------------
*/

#define T1IR_CR3INT                0x80   /* Bit 7: CR3INT (Interrupt flag for capture channel 3) */
#define T1IR_CR3INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_CR3INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_CR2INT                0x40   /* Bit 6: CR2INT (Interrupt flag for capture channel 2) */
#define T1IR_CR2INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_CR2INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_CR1INT                0x20   /* Bit 5: CR1INT (Interrupt flag for capture channel 1) */
#define T1IR_CR1INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_CR1INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_CR0INT                0x10   /* Bit 4: CR0INT (Interrupt flag for capture channel 0) */
#define T1IR_CR0INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_CR0INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_MR3INT                0x08   /* Bit 3: MR3INT (Interrupt flag for match channel 3) */
#define T1IR_MR3INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_MR3INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_MR2INT                0x04   /* Bit 2: MR2INT (Interrupt flag for match channel 2) */
#define T1IR_MR2INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_MR2INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_MR1INT                0x02   /* Bit 1: MR1INT (Interrupt flag for match channel 1) */
#define T1IR_MR1INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_MR1INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_MR0INT                0x01   /* Bit 0: MR0INT (Interrupt flag for match channel 0) */
#define T1IR_MR0INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_MR0INT_INTERRUPT      0x01   /* Interrupt */


/*
**---------------------------------------------------------------------------
**  Timer 1 Timer Control Register
**---------------------------------------------------------------------------
*/

#define T1TCR_CR                   0x02   /* Bit 1: CR (Counter reset) */
#define T1TCR_CR_NO_RESET          0x00   /* No reset */
#define T1TCR_CR_RESET             0x01   /* Generate reset */

#define T1TCR_CE                   0x01   /* Bit 0: CE (Counter enable) */
#define T1TCR_CE_DISABLED          0x00   /* Disabled */
#define T1TCR_CE_ENABLED           0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Timer 1 Timer Counter
**---------------------------------------------------------------------------
*/

#define T1TC_VALUE                 0xffffffff /* Bit 31-0: VALUE (Timer counter value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Prescale Register
**---------------------------------------------------------------------------
*/

#define T1PR_VALUE                 0xffffffff /* Bit 31-0: VALUE (Timer prescaler max value) */


