iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Timer 1 Prescale Counter
**---------------------------------------------------------------------------
*/

#define T1PC_VALUE                 0xffffffff /* Bit 31-0: VALUE (Timer prescale counter value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Match Control Register
**---------------------------------------------------------------------------
*/

#define T1MCR_MR3STOP              0x800  /* Bit 11: MR3STOP (Stop on MR3) */
#define T1MCR_MR3STOP_DISABLED     0x00   /* Disabled */
#define T1MCR_MR3STOP_ENABLED      0x01   /* Enabled */

#define T1MCR_MR3RES               0x400  /* Bit 10: MR3RES (Reset on MR3) */
#define T1MCR_MR3RES_DISABLED      0x00   /* Disabled */
#define T1MCR_MR3RES_ENABLED       0x01   /* Enabled */

#define T1MCR_MR3INT               0x200  /* Bit 9: MR3INT (Interrupt on MR3) */
#define T1MCR_MR3INT_DISABLED      0x00   /* Disabled */
#define T1MCR_MR3INT_ENABLED       0x01   /* Enabled */

#define T1MCR_MR2STOP              0x100  /* Bit 8: MR2STOP (Stop on MR2) */
#define T1MCR_MR2STOP_DISABLED     0x00   /* Disabled */
#define T1MCR_MR2STOP_ENABLED      0x01   /* Enabled */

#define T1MCR_MR2RES               0x80   /* Bit 7: MR2RES (Reset on MR2) */
#define T1MCR_MR2RES_DISABLED      0x00   /* Disabled */
#define T1MCR_MR2RES_ENABLED       0x01   /* Enabled */

#define T1MCR_MR2INT               0x40   /* Bit 6: MR2INT (Interrupt on MR2) */
#define T1MCR_MR2INT_DISABLED      0x00   /* Disabled */
#define T1MCR_MR2INT_ENABLED       0x01   /* Enabled */

#define T1MCR_MR1STOP              0x20   /* Bit 5: MR1STOP (Stop on MR1) */
#define T1MCR_MR1STOP_DISABLED     0x00   /* Disabled */
#define T1MCR_MR1STOP_ENABLED      0x01   /* Enabled */

#define T1MCR_MR1RES               0x10   /* Bit 4: MR1RES (Reset on MR1) */
#define T1MCR_MR1RES_DISABLED      0x00   /* Disabled */
#define T1MCR_MR1RES_ENABLED       0x01   /* Enabled */

#define T1MCR_MR1INT               0x08   /* Bit 3: MR1INT (Interrupt on MR1) */
#define T1MCR_MR1INT_DISABLED      0x00   /* Disabled */
#define T1MCR_MR1INT_ENABLED       0x01   /* Enabled */

#define T1MCR_MR0STOP              0x04   /* Bit 2: MR0STOP (Stop on MR0) */
#define T1MCR_MR0STOP_DISABLED     0x00   /* Disabled */
#define T1MCR_MR0STOP_ENABLED      0x01   /* Enabled */

#define T1MCR_MR0RES               0x02   /* Bit 1: MR0RES (Reset on MR0) */
#define T1MCR_MR0RES_DISABLED      0x00   /* Disabled */
#define T1MCR_MR0RES_ENABLED       0x01   /* Enabled */

#define T1MCR_MR0INT               0x01   /* Bit 0: MR0INT (Interrupt on MR0) */
#define T1MCR_MR0INT_DISABLED      0x00   /* Disabled */
#define T1MCR_MR0INT_ENABLED       0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Timer 1 Match Register 0
**---------------------------------------------------------------------------
*/

#define T1MR0_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Match Register 1
**---------------------------------------------------------------------------
*/

#define T1MR1_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Match Register 2
**---------------------------------------------------------------------------
*/

#define T1MR2_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Match Register 3
**---------------------------------------------------------------------------
*/

#define T1MR3_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Capture Control Register
**---------------------------------------------------------------------------
*/

#define T1CCR_CAP3INT              0x800  /* Bit 11: CAP3INT (Interrupt on capture CAP3) */
#define T1CCR_CAP3INT_DISABLED     0x00   /* Disabled */
#define T1CCR_CAP3INT_ENABLED      0x01   /* Enabled */

#define T1CCR_CAP3FE               0x400  /* Bit 10: CAP3FE (Capture on CAP3 falling edge) */
#define T1CCR_CAP3FE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP3FE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP3RE               0x200  /* Bit 9: CAP3RE (Capture on CAP3 rising edge) */
#define T1CCR_CAP3RE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP3RE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP2INT              0x100  /* Bit 8: CAP2INT (Interrupt on capture CAP2) */
#define T1CCR_CAP2INT_DISABLED     0x00   /* Disabled */
#define T1CCR_CAP2INT_ENABLED      0x01   /* Enabled */

#define T1CCR_CAP2FE               0x80   /* Bit 7: CAP2FE (Capture on CAP2 falling edge) */
#define T1CCR_CAP2FE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP2FE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP2RE               0x40   /* Bit 6: CAP2RE (Capture on CAP2 rising edge) */
#define T1CCR_CAP2RE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP2RE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP1INT              0x20   /* Bit 5: CAP1INT (Interrupt on capture CAP1) */
#define T1CCR_CAP1INT_DISABLED     0x00   /* Disabled */
#define T1CCR_CAP1INT_ENABLED      0x01   /* Enabled */

#define T1CCR_CAP1FE               0x10   /* Bit 4: CAP1FE (Capture on CAP1 falling edge) */
#define T1CCR_CAP1FE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP1FE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP1RE               0x08   /* Bit 3: CAP1RE (Capture on CAP1 rising edge) */
#define T1CCR_CAP1RE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP1RE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP0INT              0x04   /* Bit 2: CAP0INT (Interrupt on capture CAP0) */
#define T1CCR_CAP0INT_DISABLED     0x00   /* Disabled */
#define T1CCR_CAP0INT_ENABLED      0x01   /* Enabled */

#define T1CCR_CAP0FE               0x02   /* Bit 1: CAP0FE (Capture on CAP0 falling edge) */
#define T1CCR_CAP0FE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP0FE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP0RE               0x01   /* Bit 0: CAP0RE (Capture on CAP0 rising edge) */
#define T1CCR_CAP0RE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP0RE_ENABLED       0x01   /* Enabled */


