iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  UART1 Divisor Latch MSB
**---------------------------------------------------------------------------
*/

#define U1DLM_DIVM                 0xff   /* Bit 7-0: DIVM (Baud rate generator divisor [15:8]) */


/*
**---------------------------------------------------------------------------
**  UART1 Interrupt Enable Register
**---------------------------------------------------------------------------
*/

#define U1IER_MSIE                 0x08   /* Bit 3: MSIE (Modem status interrupt enable (MODEM)) */
#define U1IER_MSIE_DISABLED        0x00   /* Disabled */
#define U1IER_MSIE_ENABLED         0x01   /* Enabled */

#define U1IER_RXLSIE               0x04   /* Bit 2: RXLSIE (Rx Line status interrupt enable (RXLINE)) */
#define U1IER_RXLSIE_DISABLED      0x00   /* Disabled */
#define U1IER_RXLSIE_ENABLED       0x01   /* Enabled */

#define U1IER_THREIE               0x02   /* Bit 1: THREIE (Transmit interrupt enable (THRE)) */
#define U1IER_THREIE_DISABLED      0x00   /* Disabled */
#define U1IER_THREIE_ENABLED       0x01   /* Enabled */

#define U1IER_RDAIE                0x01   /* Bit 0: RDAIE (Receive interrupt enable (RDA)) */
#define U1IER_RDAIE_DISABLED       0x00   /* Disabled */
#define U1IER_RDAIE_ENABLED        0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  UART1 Interrupt ID Register
**---------------------------------------------------------------------------
*/

#define U1IIR_IIRFE                0xc0   /* Bit 7-6: IIRFE (FIFO enable) */
#define U1IIR_IIRFE_ONE            0x00   /* 1 (Trigger level 0 (=1)) */
#define U1IIR_IIRFE_FOUR           0x01   /* 4 (Trigger level 1 (=4)) */
#define U1IIR_IIRFE_EIGHT          0x02   /* 8 (Trigger level 2 (=8)) */
#define U1IIR_IIRFE_FOURTEEN       0x03   /* 14 (Trigger level 3 (=14)) */

#define U1IIR_IID                  0x0e   /* Bit 3-1: IID (Interrupt identification) */
#define U1IIR_IID_MODEM_INT        0x00   /* Modem interrupt (Fourth priority) */
#define U1IIR_IID_THRE_INT         0x01   /* Transmit buffer empty interrupt (THRE) (Third priority) */
#define U1IIR_IID_CTI_INT          0x06   /* Character timeout interrupt (CTI) (Second priority) */
#define U1IIR_IID_RDA_INT          0x02   /* Receive data available or Trigger level interrupt code (RDA) (Second priority) */
#define U1IIR_IID_RX_LINE_INT      0x03   /* Receive line status interrupt (Highest priority) */

#define U1IIR_IP                   0x01   /* Bit 0: IP (Interrupt pending) */
#define U1IIR_IP_INTERRUPT         0x00   /* Interrupt pending  */
#define U1IIR_IP_NO_INTERRUPT      0x01   /* No pending interrupt */


/*
**---------------------------------------------------------------------------
**  UART1 FIFO Control Register
**---------------------------------------------------------------------------
*/

#define U1FCR_RTLS                 0xc0   /* Bit 7-6: RTLS (Receive FIFO trigger level) */
#define U1FCR_RTLS_ONE             0x00   /* 1 (Trigger level 0 (=1)) */
#define U1FCR_RTLS_FOUR            0x01   /* 4 (Trigger level 1 (=4)) */
#define U1FCR_RTLS_EIGHT           0x02   /* 8 (Trigger level 2 (=8)) */
#define U1FCR_RTLS_FOURTEEN        0x03   /* 14 (Trigger level 3 (=14)) */

#define U1FCR_TFR                  0x04   /* Bit 2: TFR (Clear transmit FIFO) */
#define U1FCR_TFR_NOTHING          0x00   /* Nothing happens */
#define U1FCR_TFR_RESET            0x01   /* Reset transfer pointers and clear TX FIFO */

#define U1FCR_RFR                  0x02   /* Bit 1: RFR (Clear receive FIFO) */
#define U1FCR_RFR_NOTHING          0x00   /* Nothing happens */
#define U1FCR_RFR_RESET            0x01   /* Reset receive pointers and clear RX FIFO */

#define U1FCR_FCRFE                0x01   /* Bit 0: FCRFE (FIFO enable) */
#define U1FCR_FCRFE_DISABLED       0x00   /* Disabled (Disabled FIFOs) */
#define U1FCR_FCRFE_ENABLED        0x01   /* Enabled (Enable TX and RX FIFOs) */


/*
**---------------------------------------------------------------------------
**  UART1 Line Control Register
**---------------------------------------------------------------------------
*/

#define U1LCR_DLAB                 0x80   /* Bit 7: DLAB (Divisor latch access bit) */
#define U1LCR_DLAB_TX_RX           0x00   /* Access transmit/receive registers */
#define U1LCR_DLAB_DIVISOR         0x01   /* Access divisor registers (Divisor used for baud rate generator ) */

#define U1LCR_BC                   0x40   /* Bit 6: BC (Break control) */
#define U1LCR_BC_DISABLED          0x00   /* Disabled (No break) */
#define U1LCR_BC_ENABLED           0x01   /* Enabled (Send continous 0 on transmit output) */

#define U1LCR_PS                   0x30   /* Bit 5-4: PS (Parity select) */
#define U1LCR_PS_ODD               0x00   /* Odd parity */
#define U1LCR_PS_EVEN              0x01   /* Even parity */
#define U1LCR_PS_FORCED_1          0x02   /* Forced "1" stick parity */
#define U1LCR_PS_FORCED_0          0x03   /* Forced "0" stick parity */

#define U1LCR_PE                   0x08   /* Bit 3: PE (Parity enable) */
#define U1LCR_PE_DISABLED          0x00   /* Disabled (No parity generation and checking) */
#define U1LCR_PE_ENABLED           0x01   /* Enabled (Parity generation and checking) */

#define U1LCR_SBS                  0x04   /* Bit 2: SBS (Stop bit select) */
#define U1LCR_SBS_S1               0x00   /* 1 stop bit */
#define U1LCR_SBS_S2               0x01   /* 2 stop bits ((=1.5 if 5 bit character length is used)) */

#define U1LCR_WLS                  0x03   /* Bit 1-0: WLS (Word length select) */
#define U1LCR_WLS_D5               0x00   /* 5 data bits */
#define U1LCR_WLS_D6               0x01   /* 6 data bits */
#define U1LCR_WLS_D7               0x02   /* 7 data bits */
#define U1LCR_WLS_D8               0x03   /* 8 data bits */


/*
**---------------------------------------------------------------------------
**  UART1 Modem Control Register
**---------------------------------------------------------------------------
*/

