iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
#define ILR_RTCCIF                 0x01   /* Bit 0: RTCCIF (RTC Counter Increment interrupt flag) */
#define ILR_RTCCIF_NO_INTERRUPT    0x00   /* No interrupt */
#define ILR_RTCCIF_INTERRUPT       0x01   /* Interrupt */


/*
**---------------------------------------------------------------------------
**  Clock Tick Counnter
**---------------------------------------------------------------------------
*/

#define CTC_COUNTER                0xfffe /* Bit 15-1: COUNTER (Clock tick counter) */


/*
**---------------------------------------------------------------------------
**  Clock Control Register
**---------------------------------------------------------------------------
*/

#define CCR_CTTEST                 0x0c   /* Bit 3-2: CTTEST (Test enable) */
#define CCR_CTTEST_NORMAL          0x00   /* Normal operation */

#define CCR_CTCRST                 0x02   /* Bit 1: CTCRST (Clock tick counter reset) */
#define CCR_CTCRST_NO_RESET        0x00   /* No reset */
#define CCR_CTCRST_RESET           0x01   /* Generate reset */

#define CCR_CLKEN                  0x01   /* Bit 0: CLKEN (Clock enable) */
#define CCR_CLKEN_DISABLED         0x00   /* Disabled */
#define CCR_CLKEN_ENABLED          0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Counter Increment Interrupt Register
**---------------------------------------------------------------------------
*/

#define CIIR_IMYEAR                0x80   /* Bit 7: IMYEAR (Increment year interrupt) */
#define CIIR_IMYEAR_DISABLED       0x00   /* Disabled */
#define CIIR_IMYEAR_ENABLED        0x01   /* Enabled */

#define CIIR_IMMON                 0x40   /* Bit 6: IMMON (Increment month interrupt) */
#define CIIR_IMMON_DISABLED        0x00   /* Disabled */
#define CIIR_IMMON_ENABLED         0x01   /* Enabled */

#define CIIR_IMDOY                 0x20   /* Bit 5: IMDOY (Increment day of year interrupt) */
#define CIIR_IMDOY_DISABLED        0x00   /* Disabled */
#define CIIR_IMDOY_ENABLED         0x01   /* Enabled */

#define CIIR_IMDOW                 0x10   /* Bit 4: IMDOW (Increment day of week interrupt) */
#define CIIR_IMDOW_DISABLED        0x00   /* Disabled */
#define CIIR_IMDOW_ENABLED         0x01   /* Enabled */

#define CIIR_IMDOM                 0x08   /* Bit 3: IMDOM (Increment day of month interrupt) */
#define CIIR_IMDOM_DISABLED        0x00   /* Disabled */
#define CIIR_IMDOM_ENABLED         0x01   /* Enabled */

#define CIIR_IMHOUR                0x04   /* Bit 2: IMHOUR (Increment hour interrupt) */
#define CIIR_IMHOUR_DISABLED       0x00   /* Disabled */
#define CIIR_IMHOUR_ENABLED        0x01   /* Enabled */

#define CIIR_IMMIN                 0x02   /* Bit 1: IMMIN (Increment minute interrupt) */
#define CIIR_IMMIN_DISABLED        0x00   /* Disabled */
#define CIIR_IMMIN_ENABLED         0x01   /* Enabled */

#define CIIR_IMSEC                 0x01   /* Bit 0: IMSEC (Increment second interrupt) */
#define CIIR_IMSEC_DISABLED        0x00   /* Disabled */
#define CIIR_IMSEC_ENABLED         0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Alarm Mask Register
**---------------------------------------------------------------------------
*/

#define AMR_AMRYEAR                0x80   /* Bit 7: AMRYEAR (Alarm mask year) */
#define AMR_AMRYEAR_ENABLED        0x00   /* Enabled */
#define AMR_AMRYEAR_DISABLED       0x01   /* Disabled */

#define AMR_AMRMON                 0x40   /* Bit 6: AMRMON (Alarm mask month) */
#define AMR_AMRMON_ENABLED         0x00   /* Enabled */
#define AMR_AMRMON_DISABLED        0x01   /* Disabled */

#define AMR_AMRDOY                 0x20   /* Bit 5: AMRDOY (Alarm mask day of year) */
#define AMR_AMRDOY_ENABLED         0x00   /* Enabled */
#define AMR_AMRDOY_DISABLED        0x01   /* Disabled */

#define AMR_AMRDOW                 0x10   /* Bit 4: AMRDOW (Alarm mask day of week) */
#define AMR_AMRDOW_ENABLED         0x00   /* Enabled */
#define AMR_AMRDOW_DISABLED        0x01   /* Disabled */

#define AMR_AMRDOM                 0x08   /* Bit 3: AMRDOM (Alarm mask day of month) */
#define AMR_AMRDOM_ENABLED         0x00   /* Enabled */
#define AMR_AMRDOM_DISABLED        0x01   /* Disabled */

#define AMR_AMRHOUR                0x04   /* Bit 2: AMRHOUR (Alarm mask hour) */
#define AMR_AMRHOUR_ENABLED        0x00   /* Enabled */
#define AMR_AMRHOUR_DISABLED       0x01   /* Disabled */

#define AMR_AMRMIN                 0x02   /* Bit 1: AMRMIN (Alarm mask minute) */
#define AMR_AMRMIN_ENABLED         0x00   /* Enabled */
#define AMR_AMRMIN_DISABLED        0x01   /* Disabled */

#define AMR_AMRSEC                 0x01   /* Bit 0: AMRSEC (Alarm mask second ) */
#define AMR_AMRSEC_ENABLED         0x00   /* Enabled */
#define AMR_AMRSEC_DISABLED        0x01   /* Disabled */


/*
**---------------------------------------------------------------------------
**  Consolidated Time Register 0
**---------------------------------------------------------------------------
*/

#define CTIME0_DOW                 0x7000000 /* Bit 26-24: DOW (Day of week (0-6)) */

#define CTIME0_HOUR                0x1f0000 /* Bit 20-16: HOUR (Hour (0-23)) */

#define CTIME0_MIN                 0x3f00 /* Bit 13-8: MIN (Minute (0-59)) */

#define CTIME0_SEC                 0x3f   /* Bit 5-0: SEC (Second (0-59)) */


/*
**---------------------------------------------------------------------------
**  Consolidated Time Register 1
**---------------------------------------------------------------------------
*/

#define CTIME1_YEAR                0xfff0000 /* Bit 27-16: YEAR (Year (0-4095)) */

#define CTIME1_MON                 0xf00  /* Bit 11-8: MON (Month (1-12)) */

#define CTIME1_DOM                 0x1f   /* Bit 4-0: DOM (Day of month (1-28,29,30,31)) */


/*
**---------------------------------------------------------------------------
**  Consolidated Time Register 2
**---------------------------------------------------------------------------
*/

#define CTIME2_DOY                 0xfff  /* Bit 11-0: DOY (Day of year (1-365,366)) */


