iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Seconds Register
**---------------------------------------------------------------------------
*/

#define SEC_SEC                    0x3f   /* Bit 5-0: SEC (Seconds (0-59)) */


/*
**---------------------------------------------------------------------------
**  Minutes Register
**---------------------------------------------------------------------------
*/

#define MIN_MIN                    0x3f   /* Bit 5-0: MIN (Minutes (0-59)) */


/*
**---------------------------------------------------------------------------
**  Hours Register
**---------------------------------------------------------------------------
*/

#define HOUR_HOUR                  0x1f   /* Bit 4-0: HOUR (Hours (0-23)) */


/*
**---------------------------------------------------------------------------
**  Day of Month Register
**---------------------------------------------------------------------------
*/

#define DOM_DOM                    0x1f   /* Bit 4-0: DOM (Day of month (1-28, 29, 30, 31)) */


/*
**---------------------------------------------------------------------------
**  Day of Week Register
**---------------------------------------------------------------------------
*/

#define DOW_DOW                    0x07   /* Bit 2-0: DOW (Day of week (0-6)) */


/*
**---------------------------------------------------------------------------
**  Day of Year Register
**---------------------------------------------------------------------------
*/

#define DOY_DOY                    0x1ff  /* Bit 8-0: DOY (Day of year (1-365, 366)) */


/*
**---------------------------------------------------------------------------
**  Months Register
**---------------------------------------------------------------------------
*/

#define MONTH_MON                  0x0f   /* Bit 3-0: MON (Month (1-12)) */


/*
**---------------------------------------------------------------------------
**  Years Register
**---------------------------------------------------------------------------
*/

#define YEAR_YEAR                  0xfff  /* Bit 11-0: YEAR (Year (0-4095)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Seconds
**---------------------------------------------------------------------------
*/

#define ALSEC_SEC                  0x3f   /* Bit 5-0: SEC (Seconds (0-59)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Minutes
**---------------------------------------------------------------------------
*/

#define ALMIN_MIN                  0x3f   /* Bit 5-0: MIN (Minutes (0-59)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Hours
**---------------------------------------------------------------------------
*/

#define ALHOUR_HOUR                0x1f   /* Bit 4-0: HOUR (Hours (0-23)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Day of Month
**---------------------------------------------------------------------------
*/

#define ALDOM_DOM                  0x1f   /* Bit 4-0: DOM (Day of month (1-28, 29, 30, 31)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Day of Week
**---------------------------------------------------------------------------
*/

#define ALDOW_DOW                  0x07   /* Bit 2-0: DOW (Day of week (0-6)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Day of Year
**---------------------------------------------------------------------------
*/

#define ALDOY_DOY                  0x1ff  /* Bit 8-0: DOY (Day of year (1-365, 366)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Month
**---------------------------------------------------------------------------
*/

#define ALMON_MON                  0x0f   /* Bit 3-0: MON (Month (1-12)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Year
**---------------------------------------------------------------------------
*/

#define ALYEAR_YEAR                0xfff  /* Bit 11-0: YEAR (Year (0-4095)) */


/*
**---------------------------------------------------------------------------
**  Prescaler value, integer portion
**---------------------------------------------------------------------------
*/

#define PREINT_VALUE               0x1fff /* Bit 12-0: VALUE (Integer portion of RTC prescaler value) */


/*
**---------------------------------------------------------------------------
**  Prescaler value, fraction portion
**---------------------------------------------------------------------------
*/

#define PREFRAC_VALUE              0x7fff /* Bit 14-0: VALUE (Fractional portion of RTC prescaler value) */


/*
**---------------------------------------------------------------------------
**  GPIO Pin Value Register
**---------------------------------------------------------------------------
*/

#define IOPIN_P0_31                0x80000000 /* Bit 31: P0_31 (Port 0.31) */
#define IOPIN_P0_31_LOW            0x00   /* Low */
#define IOPIN_P0_31_HIGH           0x01   /* High */

#define IOPIN_P0_30                0x40000000 /* Bit 30: P0_30 (Port 0.30) */
#define IOPIN_P0_30_LOW            0x00   /* Low */
#define IOPIN_P0_30_HIGH           0x01   /* High */

#define IOPIN_P0_29                0x20000000 /* Bit 29: P0_29 (Port 0.29) */
#define IOPIN_P0_29_LOW            0x00   /* Low */
#define IOPIN_P0_29_HIGH           0x01   /* High */

#define IOPIN_P0_28                0x10000000 /* Bit 28: P0_28 (Port 0.28) */
#define IOPIN_P0_28_LOW            0x00   /* Low */
#define IOPIN_P0_28_HIGH           0x01   /* High */

#define IOPIN_P0_27                0x8000000 /* Bit 27: P0_27 (Port 0.27) */
#define IOPIN_P0_27_LOW            0x00   /* Low */
#define IOPIN_P0_27_HIGH           0x01   /* High */

#define IOPIN_P0_26                0x4000000 /* Bit 26: P0_26 (Port 0.26) */
#define IOPIN_P0_26_LOW            0x00   /* Low */
#define IOPIN_P0_26_HIGH           0x01   /* High */

