iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
#define IOCLR_P0_18                0x40000 /* Bit 18: P0_18 (Port 0.18) */
#define IOCLR_P0_18_LOW            0x00   /* Low */
#define IOCLR_P0_18_HIGH           0x01   /* High */

#define IOCLR_P0_17                0x20000 /* Bit 17: P0_17 (Port 0.17) */
#define IOCLR_P0_17_LOW            0x00   /* Low */
#define IOCLR_P0_17_HIGH           0x01   /* High */

#define IOCLR_P0_16                0x10000 /* Bit 16: P0_16 (Port 0.16) */
#define IOCLR_P0_16_LOW            0x00   /* Low */
#define IOCLR_P0_16_HIGH           0x01   /* High */

#define IOCLR_P0_15                0x8000 /* Bit 15: P0_15 (Port 0.15) */
#define IOCLR_P0_15_LOW            0x00   /* Low */
#define IOCLR_P0_15_HIGH           0x01   /* High */

#define IOCLR_P0_14                0x4000 /* Bit 14: P0_14 (Port 0.14) */
#define IOCLR_P0_14_LOW            0x00   /* Low */
#define IOCLR_P0_14_HIGH           0x01   /* High */

#define IOCLR_P0_13                0x2000 /* Bit 13: P0_13 (Port 0.13) */
#define IOCLR_P0_13_LOW            0x00   /* Low */
#define IOCLR_P0_13_HIGH           0x01   /* High */

#define IOCLR_P0_12                0x1000 /* Bit 12: P0_12 (Port 0.12) */
#define IOCLR_P0_12_LOW            0x00   /* Low */
#define IOCLR_P0_12_HIGH           0x01   /* High */

#define IOCLR_P0_11                0x800  /* Bit 11: P0_11 (Port 0.11) */
#define IOCLR_P0_11_LOW            0x00   /* Low */
#define IOCLR_P0_11_HIGH           0x01   /* High */

#define IOCLR_P0_10                0x400  /* Bit 10: P0_10 (Port 0.10) */
#define IOCLR_P0_10_LOW            0x00   /* Low */
#define IOCLR_P0_10_HIGH           0x01   /* High */

#define IOCLR_P0_9                 0x200  /* Bit 9: P0_9 (Port 0.9) */
#define IOCLR_P0_9_LOW             0x00   /* Low */
#define IOCLR_P0_9_HIGH            0x01   /* High */

#define IOCLR_P0_8                 0x100  /* Bit 8: P0_8 (Port 0.8) */
#define IOCLR_P0_8_LOW             0x00   /* Low */
#define IOCLR_P0_8_HIGH            0x01   /* High */

#define IOCLR_P0_7                 0x80   /* Bit 7: P0_7 (Port 0.7) */
#define IOCLR_P0_7_LOW             0x00   /* Low */
#define IOCLR_P0_7_HIGH            0x01   /* High */

#define IOCLR_P0_6                 0x40   /* Bit 6: P0_6 (Port 0.6) */
#define IOCLR_P0_6_LOW             0x00   /* Low */
#define IOCLR_P0_6_HIGH            0x01   /* High */

#define IOCLR_P0_5                 0x20   /* Bit 5: P0_5 (Port 0.5) */
#define IOCLR_P0_5_LOW             0x00   /* Low */
#define IOCLR_P0_5_HIGH            0x01   /* High */

#define IOCLR_P0_4                 0x10   /* Bit 4: P0_4 (Port 0.4) */
#define IOCLR_P0_4_LOW             0x00   /* Low */
#define IOCLR_P0_4_HIGH            0x01   /* High */

#define IOCLR_P0_3                 0x08   /* Bit 3: P0_3 (Port 0.3) */
#define IOCLR_P0_3_LOW             0x00   /* Low */
#define IOCLR_P0_3_HIGH            0x01   /* High */

#define IOCLR_P0_2                 0x04   /* Bit 2: P0_2 (Port 0.2) */
#define IOCLR_P0_2_LOW             0x00   /* Low */
#define IOCLR_P0_2_HIGH            0x01   /* High */

#define IOCLR_P0_1                 0x02   /* Bit 1: P0_1 (Port 0.1) */
#define IOCLR_P0_1_LOW             0x00   /* Low */
#define IOCLR_P0_1_HIGH            0x01   /* High */

#define IOCLR_P0_0                 0x01   /* Bit 0: P0_0 (Port 0.0) */
#define IOCLR_P0_0_LOW             0x00   /* Low */
#define IOCLR_P0_0_HIGH            0x01   /* High */


/*
**---------------------------------------------------------------------------
**  Pin Function Select Register 0
**---------------------------------------------------------------------------
*/

#define PINSEL0_P0_15              0xc0000000 /* Bit 31-30: P0_15 (Port 0.15) */
#define PINSEL0_P0_15_PORT0_15     0x00   /* GPIO Port 0.15 */
#define PINSEL0_P0_15_RI1          0x01   /* RI1 (UART1) */
#define PINSEL0_P0_15_EINT2        0x02   /* EINT2 (INTR) */

#define PINSEL0_P0_14              0x30000000 /* Bit 29-28: P0_14 (Port 0.14) */
#define PINSEL0_P0_14_PORT0_14     0x00   /* GPIO Port 0.14 */
#define PINSEL0_P0_14_DCD1         0x01   /* DCD1 (UART1) */
#define PINSEL0_P0_14_EINT1        0x02   /* EINT1 (INTR) */

#define PINSEL0_P0_13              0xc000000 /* Bit 27-26: P0_13 (Port 0.13) */
#define PINSEL0_P0_13_PORT0_13     0x00   /* GPIO Port 0.13 */
#define PINSEL0_P0_13_DTR1         0x01   /* DTR1 (UART1) */
#define PINSEL0_P0_13_MAT1_1       0x02   /* Match 1.1 (Timer 1) */

#define PINSEL0_P0_12              0x3000000 /* Bit 25-24: P0_12 (Port 0.12) */
#define PINSEL0_P0_12_PORT0_12     0x00   /* GPIO Port 0.12 */
#define PINSEL0_P0_12_DSR1         0x01   /* DSR1 (UART1) */
#define PINSEL0_P0_12_MAT1_0       0x02   /* Match 1.0 (Timer 1) */

#define PINSEL0_P0_11              0xc00000 /* Bit 23-22: P0_11 (Port 0.11) */
#define PINSEL0_P0_11_PORT0_11     0x00   /* GPIO Port 0.11 */
#define PINSEL0_P0_11_CTS1         0x01   /* CTS1 (UART1) */
#define PINSEL0_P0_11_CAP1_1       0x02   /* Capture 1.1 (Timer 1) */

#define PINSEL0_P0_10              0x300000 /* Bit 21-20: P0_10 (Port 0.10) */
#define PINSEL0_P0_10_PORT0_10     0x00   /* GPIO Port 0.10 */
#define PINSEL0_P0_10_RTS1         0x01   /* RTS1  (UART1) */
#define PINSEL0_P0_10_CAP1_0       0x02   /* Capture 1.0 (Timer 1) */

#define PINSEL0_P0_9               0xc0000 /* Bit 19-18: P0_9 (Port 0.9) */
#define PINSEL0_P0_9_PORT0_9       0x00   /* GPIO Port 0.9 */
#define PINSEL0_P0_9_RXD1          0x01   /* RxD1 (UART1) */
#define PINSEL0_P0_9_PWM6          0x02   /* PWM6 */

#define PINSEL0_P0_8               0x30000 /* Bit 17-16: P0_8 (Port 0.8) */
#define PINSEL0_P0_8_PORT0_8       0x00   /* GPIO Port 0.8 */
#define PINSEL0_P0_8_TXD1          0x01   /* TxD1 (UART1) */
#define PINSEL0_P0_8_PWM4          0x02   /* PWM4 */

#define PINSEL0_P0_7               0xc000 /* Bit 15-14: P0_7 (Port 0.7) */
#define PINSEL0_P0_7_PORT0_7       0x00   /* GPIO Port 0.7 */
#define PINSEL0_P0_7_SSEL          0x01   /* SSEL (SPI) */
#define PINSEL0_P0_7_PWM2          0x02   /* PWM2 */

#define PINSEL0_P0_6               0x3000 /* Bit 13-12: P0_6 (Port 0.6) */
#define PINSEL0_P0_6_PORT0_6       0x00   /* GPIO Port 0.6 */
#define PINSEL0_P0_6_MOSI          0x01   /* MOSI (SPI) */
#define PINSEL0_P0_6_CAP0_2        0x02   /* Capture 0.2 (Timer 0) */

#define PINSEL0_P0_5               0xc00  /* Bit 11-10: P0_5 (Port 0.5) */
#define PINSEL0_P0_5_PORT0_5       0x00   /* GPIO Port 0.5 */
#define PINSEL0_P0_5_MISO          0x01   /* MISO (SPI) */
#define PINSEL0_P0_5_MAT0_1        0x02   /* Match 0.1 (Timer 0) */

#define PINSEL0_P0_4               0x300  /* Bit 9-8: P0_4 (Port 0.4) */
#define PINSEL0_P0_4_PORT0_4       0x00   /* GPIO Port 0.4 */
#define PINSEL0_P0_4_SCK           0x01   /* SCK (SPI) */
#define PINSEL0_P0_4_CAP0_1        0x02   /* Capture 0.1 (Timer 0) */

#define PINSEL0_P0_3               0xc0   /* Bit 7-6: P0_3 (Port 0.3) */
#define PINSEL0_P0_3_PORT0_3       0x00   /* GPIO Port 0.3 */
#define PINSEL0_P0_3_SDA           0x01   /* SDA (I2C) */
#define PINSEL0_P0_3_MAT0_0        0x02   /* Match 0.0 (Timer 0) */

