iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  PLL Configuration Register
**---------------------------------------------------------------------------
*/

#define PLLCFG_PSEL                0x60   /* Bit 6-5: PSEL (PLL Divider value) */

#define PLLCFG_MSEL                0x1f   /* Bit 4-0: MSEL (PLL Multiplier value) */


/*
**---------------------------------------------------------------------------
**  PLL Status Register
**---------------------------------------------------------------------------
*/

#define PLLSTAT_PLOCK              0x400  /* Bit 10: PLOCK (PLL Lock status) */
#define PLLSTAT_PLOCK_UNLOCKED     0x00   /* Unlocked */
#define PLLSTAT_PLOCK_LOCKED       0x01   /* Locked */

#define PLLSTAT_PLLC               0x200  /* Bit 9: PLLC (PLL Connect) */
#define PLLSTAT_PLLC_DISCONNECTED  0x00   /* Disconnected */
#define PLLSTAT_PLLC_CONNECTED     0x01   /* Connected */

#define PLLSTAT_PLLE               0x100  /* Bit 8: PLLE (PLL Enabled) */
#define PLLSTAT_PLLE_DISABLED      0x00   /* Disabled */
#define PLLSTAT_PLLE_ENABLED       0x01   /* Enabled */

#define PLLSTAT_PSEL               0x60   /* Bit 6-5: PSEL (PLL Divider value) */

#define PLLSTAT_MSEL               0x1f   /* Bit 4-0: MSEL (PLL Multiplier value) */


/*
**---------------------------------------------------------------------------
**  PLL Feed Register
**---------------------------------------------------------------------------
*/

#define PLLFEED_FEED               0xff   /* Bit 7-0: FEED (PLL feed) */


/*
**---------------------------------------------------------------------------
**  Power Control Register
**---------------------------------------------------------------------------
*/

#define PCON_PD                    0x02   /* Bit 1: PD (Power down mode) */
#define PCON_PD_DISABLED           0x00   /* Disabled */
#define PCON_PD_ENABLED            0x01   /* Enabled */

#define PCON_IDL                   0x01   /* Bit 0: IDL (Idle mode) */
#define PCON_IDL_DISABLED          0x00   /* Disabled */
#define PCON_IDL_ENABLED           0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Power Control for Peripherals Register
**---------------------------------------------------------------------------
*/

#define PCONP_PCRTC                0x200  /* Bit 9: PCRTC (Power control RTC) */
#define PCONP_PCRTC_DISABLED       0x00   /* Disabled */
#define PCONP_PCRTC_ENABLED        0x01   /* Enabled */

#define PCONP_PCSPI                0x100  /* Bit 8: PCSPI (Power control SPI) */
#define PCONP_PCSPI_DISABLED       0x00   /* Disabled */
#define PCONP_PCSPI_ENABLED        0x01   /* Enabled */

#define PCONP_PCI2C                0x80   /* Bit 7: PCI2C (Power control I2C) */
#define PCONP_PCI2C_DISABLED       0x00   /* Disabled */
#define PCONP_PCI2C_ENABLED        0x01   /* Enabled */

#define PCONP_PCPWM0               0x20   /* Bit 5: PCPWM0 (Power control PWM0) */
#define PCONP_PCPWM0_DISABLED      0x00   /* Disabled */
#define PCONP_PCPWM0_ENABLED       0x01   /* Enabled */

#define PCONP_PCURT1               0x10   /* Bit 4: PCURT1 (Power control UART1) */
#define PCONP_PCURT1_DISABLED      0x00   /* Disabled */
#define PCONP_PCURT1_ENABLED       0x01   /* Enabled */

#define PCONP_PCURT0               0x08   /* Bit 3: PCURT0 (Power control UART0) */
#define PCONP_PCURT0_DISABLED      0x00   /* Disabled */
#define PCONP_PCURT0_ENABLED       0x01   /* Enabled */

#define PCONP_PCTIM1               0x04   /* Bit 2: PCTIM1 (Power control TIMER1) */
#define PCONP_PCTIM1_DISABLED      0x00   /* Disabled */
#define PCONP_PCTIM1_ENABLED       0x01   /* Enabled */

#define PCONP_PCTIM0               0x02   /* Bit 1: PCTIM0 (Power control TIMER0) */
#define PCONP_PCTIM0_DISABLED      0x00   /* Disabled */
#define PCONP_PCTIM0_ENABLED       0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  VPB Divider Register
**---------------------------------------------------------------------------
*/

#define VPBDIV_VPBDIV              0x03   /* Bit 1-0: VPBDIV (VPB divider) */
#define VPBDIV_VPBDIV_DIV_1        0x01   /* VPB bus clock is same as the processor clock */
#define VPBDIV_VPBDIV_DIV_2        0x02   /* VPB bus clock is 1/2 of the processor clock */
#define VPBDIV_VPBDIV_DIV_4        0x00   /* VPB bus clock is 1/4 of the processor clock */


/*
**---------------------------------------------------------------------------
**  External Interrupt Flag Register
**---------------------------------------------------------------------------
*/

#define EXTINT_EINT2               0x04   /* Bit 2: EINT2 (EINT2 status) */
#define EXTINT_EINT2_NO_INTERRUPT  0x00   /* No interrupt */
#define EXTINT_EINT2_INTERRUPT     0x01   /* Interrupt */

#define EXTINT_EINT1               0x02   /* Bit 1: EINT1 (EINT1 status) */
#define EXTINT_EINT1_NO_INTERRUPT  0x00   /* No interrupt */
#define EXTINT_EINT1_INTERRUPT     0x01   /* Interrupt */

#define EXTINT_EINT0               0x01   /* Bit 0: EINT0 (EINT0 status) */
#define EXTINT_EINT0_NO_INTERRUPT  0x00   /* No interrupt */
#define EXTINT_EINT0_INTERRUPT     0x01   /* Interrupt */


/*
**---------------------------------------------------------------------------
**  External Interrupt Wakeup Register
**---------------------------------------------------------------------------
*/

#define EXTWAKE_EXTWAKE2           0x04   /* Bit 2: EXTWAKE2 (EINT2 wake up) */
#define EXTWAKE_EXTWAKE2_DISABLED  0x00   /* Disabled */
#define EXTWAKE_EXTWAKE2_ENABLED   0x01   /* Enabled */

#define EXTWAKE_EXTWAKE1           0x02   /* Bit 1: EXTWAKE1 (EINT1 wake up) */
#define EXTWAKE_EXTWAKE1_DISABLED  0x00   /* Disabled */
#define EXTWAKE_EXTWAKE1_ENABLED   0x01   /* Enabled */

#define EXTWAKE_EXTWAKE0           0x01   /* Bit 0: EXTWAKE0 (EINT0 wake up) */
#define EXTWAKE_EXTWAKE0_DISABLED  0x00   /* Disabled */
#define EXTWAKE_EXTWAKE0_ENABLED   0x01   /* Enabled */


