iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  IRQ Status Register
**---------------------------------------------------------------------------
*/

#define VICIRQSTATUS_INT31         0x80000000 /* Bit 31: INT31 (Interrupt 31) */

#define VICIRQSTATUS_INT30         0x40000000 /* Bit 30: INT30 (Interrupt 30) */

#define VICIRQSTATUS_INT29         0x20000000 /* Bit 29: INT29 (Interrupt 29) */

#define VICIRQSTATUS_INT28         0x10000000 /* Bit 28: INT28 (Interrupt 28) */

#define VICIRQSTATUS_INT27         0x8000000 /* Bit 27: INT27 (Interrupt 27) */

#define VICIRQSTATUS_INT26         0x4000000 /* Bit 26: INT26 (Interrupt 26) */

#define VICIRQSTATUS_INT25         0x2000000 /* Bit 25: INT25 (Interrupt 25) */

#define VICIRQSTATUS_INT24         0x1000000 /* Bit 24: INT24 (Interrupt 24) */

#define VICIRQSTATUS_INT23         0x800000 /* Bit 23: INT23 (Interrupt 23) */

#define VICIRQSTATUS_INT22         0x400000 /* Bit 22: INT22 (Interrupt 22) */

#define VICIRQSTATUS_INT21         0x200000 /* Bit 21: INT21 (Interrupt 21) */

#define VICIRQSTATUS_INT20         0x100000 /* Bit 20: INT20 (Interrupt 20) */

#define VICIRQSTATUS_INT19         0x80000 /* Bit 19: INT19 (Interrupt 19) */

#define VICIRQSTATUS_INT18         0x40000 /* Bit 18: INT18 (Interrupt 18) */

#define VICIRQSTATUS_INT17         0x20000 /* Bit 17: INT17 (Interrupt 17) */

#define VICIRQSTATUS_INT16         0x10000 /* Bit 16: INT16 (Interrupt 16) */

#define VICIRQSTATUS_INT15         0x8000 /* Bit 15: INT15 (Interrupt 15) */

#define VICIRQSTATUS_INT14         0x4000 /* Bit 14: INT14 (Interrupt 14) */

#define VICIRQSTATUS_INT13         0x2000 /* Bit 13: INT13 (Interrupt 13) */

#define VICIRQSTATUS_INT12         0x1000 /* Bit 12: INT12 (Interrupt 12) */

#define VICIRQSTATUS_INT11         0x800  /* Bit 11: INT11 (Interrupt 11) */

#define VICIRQSTATUS_INT10         0x400  /* Bit 10: INT10 (Interrupt 10) */

#define VICIRQSTATUS_INT9          0x200  /* Bit 9: INT9 (Interrupt 9) */

#define VICIRQSTATUS_INT8          0x100  /* Bit 8: INT8 (Interrupt 8) */

#define VICIRQSTATUS_INT7          0x80   /* Bit 7: INT7 (Interrupt 7) */

#define VICIRQSTATUS_INT6          0x40   /* Bit 6: INT6 (Interrupt 6) */

#define VICIRQSTATUS_INT5          0x20   /* Bit 5: INT5 (Interrupt 5) */

#define VICIRQSTATUS_INT4          0x10   /* Bit 4: INT4 (Interrupt 4) */

#define VICIRQSTATUS_INT3          0x08   /* Bit 3: INT3 (Interrupt 3) */

#define VICIRQSTATUS_INT2          0x04   /* Bit 2: INT2 (Interrupt 2) */

#define VICIRQSTATUS_INT1          0x02   /* Bit 1: INT1 (Interrupt 1) */

#define VICIRQSTATUS_INT0          0x01   /* Bit 0: INT0 (Interrupt 0) */


/*
**---------------------------------------------------------------------------
**  FIQ Status Register
**---------------------------------------------------------------------------
*/

#define VICFIQSTATUS_INT31         0x80000000 /* Bit 31: INT31 (Interrupt 31) */

#define VICFIQSTATUS_INT30         0x40000000 /* Bit 30: INT30 (Interrupt 30) */

#define VICFIQSTATUS_INT29         0x20000000 /* Bit 29: INT29 (Interrupt 29) */

#define VICFIQSTATUS_INT28         0x10000000 /* Bit 28: INT28 (Interrupt 28) */

#define VICFIQSTATUS_INT27         0x8000000 /* Bit 27: INT27 (Interrupt 27) */

#define VICFIQSTATUS_INT26         0x4000000 /* Bit 26: INT26 (Interrupt 26) */

#define VICFIQSTATUS_INT25         0x2000000 /* Bit 25: INT25 (Interrupt 25) */

#define VICFIQSTATUS_INT24         0x1000000 /* Bit 24: INT24 (Interrupt 24) */

#define VICFIQSTATUS_INT23         0x800000 /* Bit 23: INT23 (Interrupt 23) */

#define VICFIQSTATUS_INT22         0x400000 /* Bit 22: INT22 (Interrupt 22) */

#define VICFIQSTATUS_INT21         0x200000 /* Bit 21: INT21 (Interrupt 21) */

#define VICFIQSTATUS_INT20         0x100000 /* Bit 20: INT20 (Interrupt 20) */

#define VICFIQSTATUS_INT19         0x80000 /* Bit 19: INT19 (Interrupt 19) */

#define VICFIQSTATUS_INT18         0x40000 /* Bit 18: INT18 (Interrupt 18) */

#define VICFIQSTATUS_INT17         0x20000 /* Bit 17: INT17 (Interrupt 17) */

#define VICFIQSTATUS_INT16         0x10000 /* Bit 16: INT16 (Interrupt 16) */

#define VICFIQSTATUS_INT15         0x8000 /* Bit 15: INT15 (Interrupt 15) */

#define VICFIQSTATUS_INT14         0x4000 /* Bit 14: INT14 (Interrupt 14) */

#define VICFIQSTATUS_INT13         0x2000 /* Bit 13: INT13 (Interrupt 13) */

#define VICFIQSTATUS_INT12         0x1000 /* Bit 12: INT12 (Interrupt 12) */

#define VICFIQSTATUS_INT11         0x800  /* Bit 11: INT11 (Interrupt 11) */

#define VICFIQSTATUS_INT10         0x400  /* Bit 10: INT10 (Interrupt 10) */

#define VICFIQSTATUS_INT9          0x200  /* Bit 9: INT9 (Interrupt 9) */

#define VICFIQSTATUS_INT8          0x100  /* Bit 8: INT8 (Interrupt 8) */

#define VICFIQSTATUS_INT7          0x80   /* Bit 7: INT7 (Interrupt 7) */

#define VICFIQSTATUS_INT6          0x40   /* Bit 6: INT6 (Interrupt 6) */

#define VICFIQSTATUS_INT5          0x20   /* Bit 5: INT5 (Interrupt 5) */

#define VICFIQSTATUS_INT4          0x10   /* Bit 4: INT4 (Interrupt 4) */

#define VICFIQSTATUS_INT3          0x08   /* Bit 3: INT3 (Interrupt 3) */

#define VICFIQSTATUS_INT2          0x04   /* Bit 2: INT2 (Interrupt 2) */

#define VICFIQSTATUS_INT1          0x02   /* Bit 1: INT1 (Interrupt 1) */

#define VICFIQSTATUS_INT0          0x01   /* Bit 0: INT0 (Interrupt 0) */


/*
**---------------------------------------------------------------------------
**  VIQ Raw Interrupt Status Register
**---------------------------------------------------------------------------
*/

#define VICRAWINTR_INT31           0x80000000 /* Bit 31: INT31 (Interrupt 31) */

#define VICRAWINTR_INT30           0x40000000 /* Bit 30: INT30 (Interrupt 30) */

#define VICRAWINTR_INT29           0x20000000 /* Bit 29: INT29 (Interrupt 29) */

#define VICRAWINTR_INT28           0x10000000 /* Bit 28: INT28 (Interrupt 28) */

#define VICRAWINTR_INT27           0x8000000 /* Bit 27: INT27 (Interrupt 27) */

#define VICRAWINTR_INT26           0x4000000 /* Bit 26: INT26 (Interrupt 26) */

#define VICRAWINTR_INT25           0x2000000 /* Bit 25: INT25 (Interrupt 25) */

#define VICRAWINTR_INT24           0x1000000 /* Bit 24: INT24 (Interrupt 24) */

#define VICRAWINTR_INT23           0x800000 /* Bit 23: INT23 (Interrupt 23) */

#define VICRAWINTR_INT22           0x400000 /* Bit 22: INT22 (Interrupt 22) */

#define VICRAWINTR_INT21           0x200000 /* Bit 21: INT21 (Interrupt 21) */

#define VICRAWINTR_INT20           0x100000 /* Bit 20: INT20 (Interrupt 20) */

#define VICRAWINTR_INT19           0x80000 /* Bit 19: INT19 (Interrupt 19) */

#define VICRAWINTR_INT18           0x40000 /* Bit 18: INT18 (Interrupt 18) */

#define VICRAWINTR_INT17           0x20000 /* Bit 17: INT17 (Interrupt 17) */

