iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Software Interrupt Register
**---------------------------------------------------------------------------
*/

#define VICSOFTINT_INT31           0x80000000 /* Bit 31: INT31 (Interrupt 31) */
#define VICSOFTINT_INT31_LOW       0x00   /* Low */
#define VICSOFTINT_INT31_HIGH      0x01   /* High */

#define VICSOFTINT_INT30           0x40000000 /* Bit 30: INT30 (Interrupt 30) */
#define VICSOFTINT_INT30_LOW       0x00   /* Low */
#define VICSOFTINT_INT30_HIGH      0x01   /* High */

#define VICSOFTINT_INT29           0x20000000 /* Bit 29: INT29 (Interrupt 29) */
#define VICSOFTINT_INT29_LOW       0x00   /* Low */
#define VICSOFTINT_INT29_HIGH      0x01   /* High */

#define VICSOFTINT_INT28           0x10000000 /* Bit 28: INT28 (Interrupt 28) */
#define VICSOFTINT_INT28_LOW       0x00   /* Low */
#define VICSOFTINT_INT28_HIGH      0x01   /* High */

#define VICSOFTINT_INT27           0x8000000 /* Bit 27: INT27 (Interrupt 27) */
#define VICSOFTINT_INT27_LOW       0x00   /* Low */
#define VICSOFTINT_INT27_HIGH      0x01   /* High */

#define VICSOFTINT_INT26           0x4000000 /* Bit 26: INT26 (Interrupt 26) */
#define VICSOFTINT_INT26_LOW       0x00   /* Low */
#define VICSOFTINT_INT26_HIGH      0x01   /* High */

#define VICSOFTINT_INT25           0x2000000 /* Bit 25: INT25 (Interrupt 25) */
#define VICSOFTINT_INT25_LOW       0x00   /* Low */
#define VICSOFTINT_INT25_HIGH      0x01   /* High */

#define VICSOFTINT_INT24           0x1000000 /* Bit 24: INT24 (Interrupt 24) */
#define VICSOFTINT_INT24_LOW       0x00   /* Low */
#define VICSOFTINT_INT24_HIGH      0x01   /* High */

#define VICSOFTINT_INT23           0x800000 /* Bit 23: INT23 (Interrupt 23) */
#define VICSOFTINT_INT23_LOW       0x00   /* Low */
#define VICSOFTINT_INT23_HIGH      0x01   /* High */

#define VICSOFTINT_INT22           0x400000 /* Bit 22: INT22 (Interrupt 22) */
#define VICSOFTINT_INT22_LOW       0x00   /* Low */
#define VICSOFTINT_INT22_HIGH      0x01   /* High */

#define VICSOFTINT_INT21           0x200000 /* Bit 21: INT21 (Interrupt 21) */
#define VICSOFTINT_INT21_LOW       0x00   /* Low */
#define VICSOFTINT_INT21_HIGH      0x01   /* High */

#define VICSOFTINT_INT20           0x100000 /* Bit 20: INT20 (Interrupt 20) */
#define VICSOFTINT_INT20_LOW       0x00   /* Low */
#define VICSOFTINT_INT20_HIGH      0x01   /* High */

#define VICSOFTINT_INT19           0x80000 /* Bit 19: INT19 (Interrupt 19) */
#define VICSOFTINT_INT19_LOW       0x00   /* Low */
#define VICSOFTINT_INT19_HIGH      0x01   /* High */

#define VICSOFTINT_INT18           0x40000 /* Bit 18: INT18 (Interrupt 18) */
#define VICSOFTINT_INT18_LOW       0x00   /* Low */
#define VICSOFTINT_INT18_HIGH      0x01   /* High */

#define VICSOFTINT_INT17           0x20000 /* Bit 17: INT17 (Interrupt 17) */
#define VICSOFTINT_INT17_LOW       0x00   /* Low */
#define VICSOFTINT_INT17_HIGH      0x01   /* High */

#define VICSOFTINT_INT16           0x10000 /* Bit 16: INT16 (Interrupt 16) */
#define VICSOFTINT_INT16_LOW       0x00   /* Low */
#define VICSOFTINT_INT16_HIGH      0x01   /* High */

#define VICSOFTINT_INT15           0x8000 /* Bit 15: INT15 (Interrupt 15) */
#define VICSOFTINT_INT15_LOW       0x00   /* Low */
#define VICSOFTINT_INT15_HIGH      0x01   /* High */

#define VICSOFTINT_INT14           0x4000 /* Bit 14: INT14 (Interrupt 14) */
#define VICSOFTINT_INT14_LOW       0x00   /* Low */
#define VICSOFTINT_INT14_HIGH      0x01   /* High */

#define VICSOFTINT_INT13           0x2000 /* Bit 13: INT13 (Interrupt 13) */
#define VICSOFTINT_INT13_LOW       0x00   /* Low */
#define VICSOFTINT_INT13_HIGH      0x01   /* High */

#define VICSOFTINT_INT12           0x1000 /* Bit 12: INT12 (Interrupt 12) */
#define VICSOFTINT_INT12_LOW       0x00   /* Low */
#define VICSOFTINT_INT12_HIGH      0x01   /* High */

#define VICSOFTINT_INT11           0x800  /* Bit 11: INT11 (Interrupt 11) */
#define VICSOFTINT_INT11_LOW       0x00   /* Low */
#define VICSOFTINT_INT11_HIGH      0x01   /* High */

#define VICSOFTINT_INT10           0x400  /* Bit 10: INT10 (Interrupt 10) */
#define VICSOFTINT_INT10_LOW       0x00   /* Low */
#define VICSOFTINT_INT10_HIGH      0x01   /* High */

#define VICSOFTINT_INT9            0x200  /* Bit 9: INT9 (Interrupt 9) */
#define VICSOFTINT_INT9_LOW        0x00   /* Low */
#define VICSOFTINT_INT9_HIGH       0x01   /* High */

#define VICSOFTINT_INT8            0x100  /* Bit 8: INT8 (Interrupt 8) */
#define VICSOFTINT_INT8_LOW        0x00   /* Low */
#define VICSOFTINT_INT8_HIGH       0x01   /* High */

#define VICSOFTINT_INT7            0x80   /* Bit 7: INT7 (Interrupt 7) */
#define VICSOFTINT_INT7_LOW        0x00   /* Low */
#define VICSOFTINT_INT7_HIGH       0x01   /* High */

#define VICSOFTINT_INT6            0x40   /* Bit 6: INT6 (Interrupt 6) */
#define VICSOFTINT_INT6_LOW        0x00   /* Low */
#define VICSOFTINT_INT6_HIGH       0x01   /* High */

#define VICSOFTINT_INT5            0x20   /* Bit 5: INT5 (Interrupt 5) */
#define VICSOFTINT_INT5_LOW        0x00   /* Low */
#define VICSOFTINT_INT5_HIGH       0x01   /* High */

#define VICSOFTINT_INT4            0x10   /* Bit 4: INT4 (Interrupt 4) */
#define VICSOFTINT_INT4_LOW        0x00   /* Low */
#define VICSOFTINT_INT4_HIGH       0x01   /* High */

#define VICSOFTINT_INT3            0x08   /* Bit 3: INT3 (Interrupt 3) */
#define VICSOFTINT_INT3_LOW        0x00   /* Low */
#define VICSOFTINT_INT3_HIGH       0x01   /* High */

#define VICSOFTINT_INT2            0x04   /* Bit 2: INT2 (Interrupt 2) */
#define VICSOFTINT_INT2_LOW        0x00   /* Low */
#define VICSOFTINT_INT2_HIGH       0x01   /* High */

#define VICSOFTINT_INT1            0x02   /* Bit 1: INT1 (Interrupt 1) */
#define VICSOFTINT_INT1_LOW        0x00   /* Low */
#define VICSOFTINT_INT1_HIGH       0x01   /* High */

#define VICSOFTINT_INT0            0x01   /* Bit 0: INT0 (Interrupt 0) */
#define VICSOFTINT_INT0_LOW        0x00   /* Low */
#define VICSOFTINT_INT0_HIGH       0x01   /* High */


