iarsystems/ewarm-nxp-example-projects/LPC2103/LPC2103/TinyARMPHIL40/PHIL40-03-Lcd/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Vector Control Register 1
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL1_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL1_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL1_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL1_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 2
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL2_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL2_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL2_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL2_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 3
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL3_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL3_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL3_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL3_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 4
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL4_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL4_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL4_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL4_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 5
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL5_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL5_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL5_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL5_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 6
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL6_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL6_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL6_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL6_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 7
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL7_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL7_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL7_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL7_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 8
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL8_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL8_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL8_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL8_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 9
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL9_ENABLED       0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL9_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL9_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL9_NUMBER        0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 10
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL10_ENABLED      0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL10_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL10_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL10_NUMBER       0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 11
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL11_ENABLED      0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL11_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL11_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL11_NUMBER       0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 12
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL12_ENABLED      0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL12_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL12_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL12_NUMBER       0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


/*
**---------------------------------------------------------------------------
**  Vector Control Register 13
**---------------------------------------------------------------------------
*/

#define VICVECTCNTL13_ENABLED      0x20   /* Bit 5: ENABLED (Interrupt enabled) */
#define VICVECTCNTL13_ENABLED_DISABLED  0x00 /* Disabled */
#define VICVECTCNTL13_ENABLED_ENABLED  0x01 /* Enabled */

#define VICVECTCNTL13_NUMBER       0x1f   /* Bit 4-0: NUMBER (Interrupt is assigned to this number) */


